/*задайте массив из 12 элементов, заполненныйслучайными числами из промежтка [-9,9]. 
Найдите сумму отрицательных и положительных элементов массива.

Например, в массиве [3,9,-8,1,0,-7,2,-1,8,-3,-1,6] сумма
положительных чисел равна 29, сумма отрицательных равна
-20.*/ 

/*
int[] arr = new int[12];
randomFilling(arr, min: -9, max: 10);
arrayOutput(arr);

for(int i = 0; i < arr.Length; i++)
{
    if(arr[i]<0)
    {
        negativeNumbersSum+=array[i];
    }
    else
    {
       positiveNumbersSum+=array[i]; 
    }
}
Console.WriteLine();
Console.WriteLine(negativeNumbersSum, positiveNumbersSum );*/